Reading and Writing Data in Text Format

In [3]:
import pandas as pd
df = pd.read_csv('class5.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('class5.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!cat class5.csv

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [7]:
pd.read_csv('class5.csv', header=None)

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [8]:
pd.read_csv('class5.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d  message
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

In [9]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('class5.csv', names=names, index_col='message')

         a   b   c   d
message
message  a   b   c   d
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
parsed = pd.read_csv('class5_1.csv', index_col=['key1', 'key2'])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
pd.read_csv('class5.csv', skiprows=[0, 2, 3])

Empty DataFrame
Columns: [1, 2, 3, 4, hello]
Index: []

In [13]:
result = pd.read_csv('class5_2.csv')
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [14]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [15]:
result = pd.read_csv('class5_2.csv', na_values=['NULL'])
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [16]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('class5_2.csv', na_values=sentinels)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6   7   8   world
2     three  9  10  11  12     NaN

Writing Data to Text Format

In [17]:
data = pd.read_csv('class5_2.csv')
data

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [18]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3|4|
1|two|5|6|7|8|world
2|three|9|10|11|12|foo

In [19]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3,4,NULL
1,two,5,6,7,8,world
2,three,9,10,11,12,foo

In [20]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3,4,
two,5,6,7,8,world
three,9,10,11,12,foo

In [21]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3
5,6,7
9,10,11

Working with Delimited Formats

In [22]:
import csv
f = open('class5_3.csv')
reader = csv.reader(f)
for line in reader:print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [23]:
with open('class5_3.csv') as f:lines = list(csv.reader(f))
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

Binary Data Formats

In [24]:
frame = pd.read_csv('class5.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
frame.to_pickle('class5.csv')

In [26]:
pd.read_pickle('class5.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Reading Microsoft Excel Files

In [28]:
xlsx = pd.ExcelFile('class5.xlsx')

In [29]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [30]:
frame = pd.read_excel('class5.xlsx', 'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Interacting with Web APIs

In [33]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [34]:
data = resp.json()
data[0]['title']

'DOC: fix typos newly found by codespell'

In [35]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])
issues

,number,title,labels,state
0,55859,DOC: fix typos newly found by codespell,[],open
1,55858,Backport PR #55853: DEPS: Use ipython run_cell...,"[{'id': 527603109, 'node_id': 'MDU6TGFiZWw1Mjc...",open
2,55857,Added str to index_col attribute in the read_e...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
3,55856,DEPR: unit keyword in TimedeltaIndex,[],open
4,55855,TST: Make read_csv tests pyarrow 13 compatable...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
5,55854,"ENH: Expose PEP249 DB API ""rowcount"" in read_s...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
6,55852,Have read_json serialize directly to Arrow arrays,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
7,55849,BUG: rolling does not work with timestamp[ns][...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,55848,DOC: dropna default unclear,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
9,55846,[pre-commit.ci] pre-commit autoupdate,"[{'id': 106935113, 'node_id': 'MDU6TGFiZWwxMDY...",open
10,55845,BUG: combine_first major performance regression,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,55844,Raise ValueError for offsets which are not sup...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
12,55843,Internal `read_excel()` typing for `index_col`...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
13,55842,"Docs say `Series()` accepts an iterable, but a...","[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
14,55841,BUG: Fix rounding of percentile 99.999% to 100%,"[{'id': 57296398, 'node_id': 'MDU6TGFiZWw1NzI5...",open
15,55840,BUG: `.unstack()` malfunctions for triple Indi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
16,55838,CoW warning mode: add warning for single block...,"[{'id': 2085877452, 'node_id': 'MDU6TGFiZWwyMD...",open
17,55834,BUG: Index.get_indexer casts values is given a...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
18,55833,BUG: Index.get_indexer will change behaviour f...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
19,55832,BUG: Index.getitem returning wrong result with...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
20,55828,BUG: df.to_csv() fails to a not-yet-created fi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
21,55827,BUG/API: round-tripping non-nano datetime64s w...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
22,55825,Reorder tests in maybe_downcast_numeric,[],open
23,55824,BUG: maybe_downcast_numeric interferes with Pi...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,55820,BUG: inconsistency in Index.__getitem__ for Nu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
25,55815,BUG: Left join on index with non-unique values...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,55811,PERF: yet another 60x improvements to reindex ...,"[{'id': 71268330, 'node_id': 'MDU6TGFiZWw3MTI2...",open
27,55810,BUG: DataFrameGroupBy.sum does not respect arg...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,55809,Added code for QuarterBegin class to handle th...,[],open
29,55807,"ENH: Allow passing `read_only`, `data_only` an...","[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open

 Interacting with Databases

In [36]:
import sqlite3
query = """CREATE TABLE test
 (a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER);"""

In [38]:
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

OperationalError: table test already exists

In [39]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [40]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [41]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [42]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [43]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5